app/views/books/_form.html.erb

    <%= f.label :authors %>
    <%= f.collection_select :author_ids, Author.all, :id, :name, {}, {:multiple => true, class: 'select2'} %>
---
SELECT "authors".* FROM "authors"