app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.reviews << Review.new(name: Faker::ChuckNorris.fact)
---
INSERT INTO "books" ("title", "page_number", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Loren Ipsum"], ["page_number", "10"], ["type", 0], ["created_at", "2017-09-19 12:47:26.326944"], ["updated_at", "2017-09-19 12:47:26.326944"]]
INSERT INTO "reviews" ("name", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"